package homeworksFromPresentation;
/* Напишите приложение, котороебудет запрашивать упользователя следующие данные в произвольномпорядке,
разделенныепробелом: ФамилияИмя Отчество, дата_рождения,номер_телефона,пол
Форматы данных:фамилия,имя, отчество - строки дата_рождения- строкаформатаdd.mm.yyyy
номер_телефона - целоебеззнаковое число без форматирования пол - символ латиницейf или m.
Критерии:
 Приложение должнопроверить введенные данные по количеству. Если количествоне совпадает с требуемым,
вернуть код ошибки, обработать его и показать пользователю сообщение, что он ввел меньше и больше
данных, чем требуется.
 Приложение должно попытаться распарсить полученные значения и выделить из них требуемые параметры.
Если форматы данных не совпадают,нужно бросить исключение, соответствующее типупроблемы. Можно
использовать встроенные типы java и создать свои. Исключение должно быть корректно обработано,
пользователю выведено сообщениес информацией, что именно неверно.
 Если всё введено и обработано верно, долженсоздатьсяфайл с названием,равным фамилии, в него в одну
строкудолжны записаться полученныеданные, вида.

 */
public class Task5 {
}
